W6D5/ninety_nine_cats/app/controllers/cats_controller.rb

  def index
    @cats = Cat.all
---
SELECT  "cats".* FROM "cats" WHERE (1) LIMIT $1  [["LIMIT", 1]]