W6D3/first_routes_and_controllers/app/models/artwork.rb

INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Masterpiece"], ["image_url", "maspeace.com"], ["artist_id", 3], ["created_at", "2021-06-17 23:40:57.626557"], ["updated_at", "2021-06-17 23:40:57.626557"]]
INSERT INTO "artwork_collections" ("collection_id", "artwork_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["collection_id", 3], ["artwork_id", 1], ["created_at", "2021-06-17 23:40:57.774903"], ["updated_at", "2021-06-17 23:40:57.774903"]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "collections".* FROM "collections" WHERE "collections"."user_id" = $1 ORDER BY "collections"."id" ASC LIMIT $2  [["user_id", 3], ["LIMIT", 1]]
---
    def save!
        super
        ArtworkCollection.create(collection_id: User.find(self.artist_id).collections.first.id, artwork_id: self.id)