W6D3/first_routes_and_controllers/app/models/artwork_share.rb

    def save!
        super
        ArtworkCollection.create(collection_id: User.find(self.viewer_id).collections.first.id, artwork_id: self.artwork_id)
---
INSERT INTO "artwork_shares" ("artwork_id", "viewer_id") VALUES ($1, $2) RETURNING "id"  [["artwork_id", 1], ["viewer_id", 6]]
INSERT INTO "artwork_collections" ("collection_id", "artwork_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["collection_id", 6], ["artwork_id", 1], ["created_at", "2021-06-17 21:33:48.317973"], ["updated_at", "2021-06-17 21:33:48.317973"]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "collections".* FROM "collections" WHERE "collections"."user_id" = $1 ORDER BY "collections"."id" ASC LIMIT $2  [["user_id", 6], ["LIMIT", 1]]