W6D3/first_routes_and_controllers/app/models/user.rb

INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "Ben"], ["created_at", "2021-06-17 23:40:57.365054"], ["updated_at", "2021-06-17 23:40:57.365054"]]
INSERT INTO "collections" ("user_id", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["name", "Ben's collection"], ["created_at", "2021-06-17 23:40:57.468266"], ["updated_at", "2021-06-17 23:40:57.468266"]]
---
    def save!
        super
        Collection.create(name: "#{self.username}\'s collection", user_id: self.id)