W7D2/music_app/app/controllers/albums_controller.rb

    def new
        @bands = Band.all.sort
---
SELECT "bands".* FROM "bands"