W7D2/music_app/app/controllers/bands_controller.rb

    def index
        @bands = Band.all.sort
---
SELECT "bands".* FROM "bands"

    def destroy
        band = Band.find_by(id: params[:id])

        band.destroy
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 4]]