W6D3/first_routes_and_controllers/app/controllers/artwork_shares_controller.rb

INSERT INTO "artwork_shares" ("artwork_id", "viewer_id") VALUES ($1, $2) RETURNING "id"  [["artwork_id", 3], ["viewer_id", 1]]
---
    def create
        artwork_share = ArtworkShare.new(artwork_shares_params)

        if artwork_share.save!

SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 1]]
---
    def destroy
        render json: ArtworkShare.find(params[:id])
        ArtworkShare.destroy(params[:id])