W6D3/first_routes_and_controllers/app/controllers/artworks_controller.rb

    def index
        render json: Artwork.find_by(artist_id: params[:user_id])
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1 LIMIT $2  [["artist_id", 2], ["LIMIT", 1]]

    def create
        artwork = Artwork.new(artwork_param)
        if artwork.save!
---
INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Starry Night"], ["image_url", "urmum"], ["artist_id", 1], ["created_at", "2021-06-17 16:49:26.384080"], ["updated_at", "2021-06-17 16:49:26.384080"]]

    def update
        Artwork.update(params[:id], artwork_param)
---
UPDATE "artworks" SET "title" = $1, "image_url" = $2, "updated_at" = $3 WHERE "artworks"."id" = $4  [["title", "fasdf"], ["image_url", "asdfas"], ["updated_at", "2021-06-17 16:53:41.066618"], ["id", 4]]

    def destroy
        # render json: Artwork.find(params[:id])
        show
        Artwork.destroy(params[:id])
---
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 4]]