W6D3/first_routes_and_controllers/app/controllers/comments_controller.rb

    def index
        render json: Comment.all
---
SELECT "comments".* FROM "comments"