W6D3/first_routes_and_controllers/app/controllers/comments_controller.rb

    def index

        if params['user'].nil? && params['artwork'].nil?
            render plain: 'error'
        elsif params['user'].nil?
            comment = Comment.where(artwork_id: params['artwork']['id'])
            render json: comment
        else
            comment = Comment.where(author_id: params['user']['id'])
---
SELECT  "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1 LIMIT $2  [["artwork_id", 1], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."author_id" = $1 LIMIT $2  [["author_id", 1], ["LIMIT", 1]]

    def create
        comment = Comment.new(comment_params)

        if comment.save!
---
INSERT INTO "comments" ("author_id", "body", "artwork_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["author_id", 1], ["body", "oogabooga"], ["artwork_id", 3], ["created_at", "2021-06-17 21:57:58.227648"], ["updated_at", "2021-06-17 21:57:58.227648"]]

    def destroy
        render json: Comment.find(params[:id])
        Comment.destroy(params[:id])
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 1]]