W6D3/first_routes_and_controllers/app/controllers/likes_controller.rb

SELECT "likes".* FROM "likes" WHERE "likes"."likeable_type" = $1 AND "likes"."likeable_id" = $2  [["likeable_type", "Artwork"], ["likeable_id", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."likeable_type" = $1 AND "likes"."likeable_id" = $2  [["likeable_type", "Comment"], ["likeable_id", 1]]
---
    def index
        if params['comment'].nil? && params['artwork'].nil?
            render plain: 'error'
        elsif params['comment'].nil?
            likes = Like.where(likeable_type: 'Artwork').where(likeable_id: params['artwork']['id'])
            render json: likes
        else
            likes = Like.where(likeable_type: 'Comment').where(likeable_id: params['comment']['id'])

INSERT INTO "likes" ("likeable_type", "likeable_id", "created_at", "updated_at", "author_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["likeable_type", "Comment"], ["likeable_id", 1], ["created_at", "2021-06-17 23:59:36.289500"], ["updated_at", "2021-06-17 23:59:36.289500"], ["author_id", 4]]
---
    def create
        like = Like.new(like_params)
        if like.save!

SELECT  "likes".* FROM "likes" WHERE "likes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 1]]
---
    def destroy
        render json: Like.find(params[:id])
        Like.destroy(params[:id])