W6D3/first_routes_and_controllers/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "kevin"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE (kevin) LIMIT $1  [["LIMIT", 1]]
---
    def index
        if params['user'].nil?
            render json: User.all
        else
            user = User.find_by(username: params['user']['username'])
            if user.nil?
                render json: User.all

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "omg"], ["email", "omg@omg.com"], ["created_at", "2021-06-16 22:41:14.638523"], ["updated_at", "2021-06-16 22:41:14.638523"]]
---
    def create
        user = User.new(user_param)
        # debugger
        if user.save!

UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "test"], ["email", "test@test.com"], ["updated_at", "2021-06-16 23:22:28.525208"], ["id", 4]]
---
    def update
        User.update(params[:id], user_param)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 4]]
---
    def destroy
        render json: User.find(params[:id])
        User.destroy(params[:id])